In [1]:
import pandas as pd

data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [2]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
'a' in data

True

In [4]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [12]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [13]:
data['a': 'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [14]:
data[0 : 2]

a    0.25
b    0.50
dtype: float64

In [15]:
data[(data >0.3) & (data<0.8)]

b    0.50
c    0.75
dtype: float64

In [16]:
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [17]:
data = pd.Series(['a', 'b', 'c'] , index=[1, 3, 5])

In [18]:
data

1    a
3    b
5    c
dtype: object

In [19]:
data.loc[1]

'a'

In [20]:
data.loc[1:3]

1    a
3    b
dtype: object

In [21]:
data.iloc[1]

'b'

In [22]:
population_dict = {'California' : 388332521,
                  'Texas' : 26448193,
                  'New York' : 18523212,
                  'Florida' : 19552860,
                  'Illinois': 12662214}

population = pd.Series(population_dict)
population

area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
            'Florida': 170312, 'Illinois': 149995}

area = pd.Series(area_dict)

data = pd.DataFrame({'area': area, 'pop':population})
data

              area        pop
California  423967  388332521
Texas       695662   26448193
New York    141297   18523212
Florida     170312   19552860
Illinois    149995   12662214

In [25]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [26]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [28]:
data.area is data['area']

True

In [29]:
data.pop is data['pop']

False

In [30]:
data['density'] = data['pop'] / data['area']

In [31]:
data

              area        pop     density
California  423967  388332521  915.949876
Texas       695662   26448193   38.018740
New York    141297   18523212  131.094163
Florida     170312   19552860  114.806121
Illinois    149995   12662214   84.417574

In [32]:
data.values

array([[4.23967000e+05, 3.88332521e+08, 9.15949876e+02],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.85232120e+07, 1.31094163e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.26622140e+07, 8.44175739e+01]])

In [33]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.883325e+08  2.644819e+07  1.852321e+07  1.955286e+07  1.266221e+07
density  9.159499e+02  3.801874e+01  1.310942e+02  1.148061e+02  8.441757e+01

In [34]:
data.values[0]

array([4.23967000e+05, 3.88332521e+08, 9.15949876e+02])

In [35]:
data

              area        pop     density
California  423967  388332521  915.949876
Texas       695662   26448193   38.018740
New York    141297   18523212  131.094163
Florida     170312   19552860  114.806121
Illinois    149995   12662214   84.417574

In [38]:
data.values

array([[4.23967000e+05, 3.88332521e+08, 9.15949876e+02],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.85232120e+07, 1.31094163e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.26622140e+07, 8.44175739e+01]])

In [39]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [40]:
data.iloc[:3, :2]

              area        pop
California  423967  388332521
Texas       695662   26448193
New York    141297   18523212

In [41]:
data.iloc[:3]

              area        pop     density
California  423967  388332521  915.949876
Texas       695662   26448193   38.018740
New York    141297   18523212  131.094163